10/data/attachments/903121f7a422a7a5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:username>
            <nif:friendToBeAdded>David_including_Friend_67633_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>